# 10 Minutes to pandas

This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the Cookbook

Customarily, we import as follows:

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation

See the Data Structure Intro section

Creating a Series by passing a list of values, letting pandas create a default integer index:

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20170701', periods = 6)

In [6]:
df = pd.DataFrame(np.random.rand(6,4), index = dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2017-07-01  0.290463  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [8]:
df2 = pd.DataFrame({
    'A':1,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo' 
})

In [9]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [10]:
pd.DataFrame(
{
    'C' : pd.Series(1,index=list(range(4)),dtype='float32')
}
)

     C
0  1.0
1  1.0
2  1.0
3  1.0

In [11]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

In [12]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [13]:
df

                   A         B         C         D
2017-07-01  0.290463  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [14]:
num = pd.DataFrame({
    'data' : (1,2,3,4,5,6)
})

In [15]:
df

                   A         B         C         D
2017-07-01  0.290463  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [16]:
df.head()

                   A         B         C         D
2017-07-01  0.290463  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195

In [17]:
df.tail(3)

                   A         B         C         D
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [18]:
df.index

DatetimeIndex(['2017-07-01', '2017-07-02', '2017-07-03', '2017-07-04',
               '2017-07-05', '2017-07-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[ 0.29046251,  0.91875228,  0.02696742,  0.48858357],
       [ 0.5935808 ,  0.86699068,  0.82826501,  0.79223104],
       [ 0.54710066,  0.19568801,  0.41506772,  0.25578341],
       [ 0.37547108,  0.11898158,  0.5312804 ,  0.20811341],
       [ 0.20754955,  0.01175801,  0.44816488,  0.2471951 ],
       [ 0.2444818 ,  0.56327104,  0.8633204 ,  0.16025161]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.376441  0.445907  0.518844  0.358693
std    0.161000  0.393101  0.307333  0.240791
min    0.207550  0.011758  0.026967  0.160252
25%    0.255977  0.138158  0.423342  0.217884
50%    0.332967  0.379480  0.489723  0.251489
75%    0.504193  0.791061  0.754019  0.430384
max    0.593581  0.918752  0.863320  0.792231

In [22]:
df.T

   2017-07-01  2017-07-02  2017-07-03  2017-07-04  2017-07-05  2017-07-06
A    0.290463    0.593581    0.547101    0.375471    0.207550    0.244482
B    0.918752    0.866991    0.195688    0.118982    0.011758    0.563271
C    0.026967    0.828265    0.415068    0.531280    0.448165    0.863320
D    0.488584    0.792231    0.255783    0.208113    0.247195    0.160252

In [23]:
# 컬럼명으로 컬럼정렬
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2017-07-01  0.488584  0.026967  0.918752  0.290463
2017-07-02  0.792231  0.828265  0.866991  0.593581
2017-07-03  0.255783  0.415068  0.195688  0.547101
2017-07-04  0.208113  0.531280  0.118982  0.375471
2017-07-05  0.247195  0.448165  0.011758  0.207550
2017-07-06  0.160252  0.863320  0.563271  0.244482

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-06  0.244482  0.563271  0.863320  0.160252
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-01  0.290463  0.918752  0.026967  0.488584

# Selection

In [25]:
df['A']

2017-07-01    0.290463
2017-07-02    0.593581
2017-07-03    0.547101
2017-07-04    0.375471
2017-07-05    0.207550
2017-07-06    0.244482
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2017-07-01  0.290463  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783

In [27]:
pd.date_range(periods=5, start='2017-08-31', freq='D')

DatetimeIndex(['2017-08-31', '2017-09-01', '2017-09-02', '2017-09-03',
               '2017-09-04'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df

                   A         B         C         D
2017-07-01  0.290463  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

### Selection by label
#### loc -> index와 컬럼명으로 데이터에 접근 할 수 있다.

In [29]:
df.loc[dates[0]]

A    0.290463
B    0.918752
C    0.026967
D    0.488584
Name: 2017-07-01 00:00:00, dtype: float64

In [30]:
df.loc[:,['A','B']]

                   A         B
2017-07-01  0.290463  0.918752
2017-07-02  0.593581  0.866991
2017-07-03  0.547101  0.195688
2017-07-04  0.375471  0.118982
2017-07-05  0.207550  0.011758
2017-07-06  0.244482  0.563271

In [31]:
df.loc['2017-07-01':'2017-07-02',['A']]

                   A
2017-07-01  0.290463
2017-07-02  0.593581

In [32]:
df.loc['2017-07-01','A']

0.29046250913534066

In [33]:
df.loc['2017-07-03','B']

0.1956880137197391

In [34]:
df.loc[dates[0],'A'] = 3

In [35]:
## loc 랑 기능 같고, 속도가 더 빠름
df.at[dates[0],'A']

3.0

## Selection by postion
#### 데이터 프레임 ~ 번째 ~ 번째 값에 접근한다.

In [36]:
df

                   A         B         C         D
2017-07-01  3.000000  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [37]:
df.iloc[3]

A    0.375471
B    0.118982
C    0.531280
D    0.208113
Name: 2017-07-04 00:00:00, dtype: float64

In [38]:
df.iloc[3:5,0:2]

                   A         B
2017-07-04  0.375471  0.118982
2017-07-05  0.207550  0.011758

In [39]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2017-07-02  0.593581  0.828265
2017-07-03  0.547101  0.415068
2017-07-05  0.207550  0.448165

In [40]:
df

                   A         B         C         D
2017-07-01  3.000000  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [41]:
df.iloc[1:3,:]

                   A         B         C         D
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783

### 값을 명확하게 가져오려면.

In [42]:
df.iloc[1,1]

0.86699068029574922

In [43]:
df.loc['2017-07-02']['B']

0.86699068029574922

In [44]:
df.iat[1,1]

0.86699068029574922

## 연습 문제
       국어 영어 수학
선정 100 80 95
믕믕이 10   5 8

인 df를 만들고 iloc와 iat 과목별, 학생별 합계를 구하시오.

In [45]:
국어 = pd.Series(data=[100, 10])
영어 = pd.Series(data=[80, 5])
수학 = pd.Series(data=[95, 8 ])

In [46]:
df = pd.DataFrame(data = {"국어":국어, "영어":영어, "수학": 수학 }
                    ,index)

SyntaxError: positional argument follows keyword argument (<ipython-input-46-fa5020a4d80b>, line 2)

In [47]:
df

                   A         B         C         D
2017-07-01  3.000000  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

## Boolean indexing

In [49]:
df[df.A > 0 ]

                   A         B         C         D
2017-07-01  3.000000  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [51]:
df[df>0]

                   A         B         C         D
2017-07-01  3.000000  0.918752  0.026967  0.488584
2017-07-02  0.593581  0.866991  0.828265  0.792231
2017-07-03  0.547101  0.195688  0.415068  0.255783
2017-07-04  0.375471  0.118982  0.531280  0.208113
2017-07-05  0.207550  0.011758  0.448165  0.247195
2017-07-06  0.244482  0.563271  0.863320  0.160252

In [52]:
df2 = df.copy()

In [53]:
df2['E'] = ['one','one','two','three','four','three']

In [59]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2017-07-03  0.547101  0.195688  0.415068  0.255783   two
2017-07-05  0.207550  0.011758  0.448165  0.247195  four

## Setting

In [67]:
s1 = pd.Series([1,2,3,4,5,6] \
               , index=pd.date_range('20130102',periods=6))

In [68]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [69]:
df.at[dates[0],'A'] = 0

In [71]:
dates

DatetimeIndex(['2017-07-01', '2017-07-02', '2017-07-03', '2017-07-04',
               '2017-07-05', '2017-07-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
df.iat[0,1] = 0

In [77]:
np.array([5] * len(df))

array([5, 5, 5, 5, 5, 5])

In [81]:
df.loc[:,'D'] = np.array([5] * len(df))

In [83]:
df2 = df.copy()

In [84]:
df2[df2 > 0] = -df2

In [85]:
df2

                   A         B         C  D
2017-07-01  0.000000  0.000000 -0.026967 -5
2017-07-02 -0.593581 -0.866991 -0.828265 -5
2017-07-03 -0.547101 -0.195688 -0.415068 -5
2017-07-04 -0.375471 -0.118982 -0.531280 -5
2017-07-05 -0.207550 -0.011758 -0.448165 -5
2017-07-06 -0.244482 -0.563271 -0.863320 -5

## Missing Data

In [91]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])

In [92]:
df1

                   A         B         C  D   E
2017-07-01  0.000000  0.000000  0.026967  5 NaN
2017-07-02  0.593581  0.866991  0.828265  5 NaN
2017-07-03  0.547101  0.195688  0.415068  5 NaN
2017-07-04  0.375471  0.118982  0.531280  5 NaN

In [93]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [99]:
df1

                   A         B         C  D    E
2017-07-01  0.000000  0.000000  0.026967  5  1.0
2017-07-02  0.593581  0.866991  0.828265  5  1.0
2017-07-03  0.547101  0.195688  0.415068  5  NaN
2017-07-04  0.375471  0.118982  0.531280  5  NaN

In [98]:
df1.dropna(how = 'any', axis=0)

                   A         B         C  D    E
2017-07-01  0.000000  0.000000  0.026967  5  1.0
2017-07-02  0.593581  0.866991  0.828265  5  1.0

In [96]:
?pd.DataFrame.dropna